# Для початку треба встановити залежності локально
# 1. python -m venv venv
# 2. Для 
#   Windows: .\venv\Scripts\activate 
#   macOS/Linux: source venv/bin/activate
# 3. pip install scikit-learn pandas numpy

# KNN Regression
# Задача 
# Маємо набір даних про будинки у Каліфорнії, кожен будинок має 8 параметрів, потрібно
# передбачити скільки скільки буде коштувати будинок якщо йому задати інші параметри
#    8 параметрів будинку:
#       ['MedInc', 'HouseAge', 'AveRooms', 'AveBedrms', 'Population', 'AveOccup', 'Latitude', 'Longitude']
#       [8.3252, 41.0, 6.984126984126984, 1.0238095238095237, 322.0, 2.5555555555555554, 37.88, -122.23]


# ! Наразі результати передбачення кепські, можливо треба покращити нормалізацію