/**
 * 
 * Порівняльне сортування
 * Коли ми проходимося по масиву і порівнюємо два знамення - це порівняльне сортування
 * Такий вид сортування для найгіршого випадку завжди має O(n * log n) 
 * 
 * 
 * 
 * Якщо у тебе 𝑛 різних елементів, то існує 𝑛! різних способів в яких вони можуть бути до
 * сортування (прийти на вхід сортувальної функції)
 * [1,2,3]
 * [1,3,2]
 * [2,1,3]
 * [2,3,1]
 * [3,1,2]
 * [3,2,1]
 * Тож для 3 елементів маємо 3!=6 способів в яких вони можуть бути (перед сортуванням)
 * 
 * 
 * Дерево рішень
 * Уяви алгоритм як дерево рішень, де:
 *    Кожен вузол — це порівняння двох елементів.
 *    Від кожного вузла йдуть дві гілки: «так» (перший елемент менший) або «ні» (перший елемент більший або рівний).
 * 
 *    Листок дерева — це результат сортування (одна з перестановок).
 * 
 * Дерево повинно мати принаймні 𝑛! листків
 *    Це означає, що для кожної з n! можливих початкових перестановок він повинен слідувати унікальним шляхом
 *    через дерево рішень і прийти до унікального листа, який відповідає правильному відсортованому порядку.
 *    
 *    Уяви, що у твого дерева рішень є менше, ніж n! листків. Це означало б, що принаймні дві різні початкові перестановки,
 *    наприклад [2,1,3] і [3,1,2], будуть вести до одного й того ж листа в дереві. Але це неможливо, бо листок дерева рішень
 *    відповідає одному, конкретному, відсортованому порядку.
 * 
 * Ми обговорили чому чому листків не може бути менше n!, але чому їх може бути більше за n!?
 *    Це відбувається через те, що деякі алгоритми сортування (особливо менш ефективні, як сортування
 *    бульбашкою або сортування вставками) можуть виконувати надлишкові порівняння.
 * 
 *    Уяви, що алгоритм, вже знаючи, що елемент А менший за Б, все одно порівнює їх знову, або робить порівняння,
 *    яке не приносить корисної інформації. У дереві рішень це буде виглядати як додаткові вузли й гілки, які в
 *    кінцевому підсумку ведуть до тих же листків, але роблять шлях до них довшим.
 * 
 * 
 * Дерево рішень для [1,2,3]:
 *                Compare 1 and 2
                    /       \
                 1<2         1>2
                 /             \
            Compare 2 and 3    Compare 1 and 3
               /    \           /     \
            2<3     2>3       1<3     1>3
          [1,2,3] [1,3,2]   [2,1,3] [2,3,1] 

 * 
 * 
 * 
 * Глибина дерева рішень
 * Кількість порівнянь, які виконує алгоритм у найгіршому випадку, — це глибина дерева рішень.
 * Ми уявляємо що наш найкращий алгоритм має n! листків (він не робить зайвих порівнянь)
 * 
 * Для двійкового дерева з 𝐿 листками мінімальна глибина дорівнює log𝐿
 * Тут 𝐿=𝑛!, отже, мінімальна глибина дорівнює log n! 
 * І тоді мінімальна кількість порівнянь:
 *    мін. кількість порівнянь≥log​(n!)
 * (Оскільки нам треба зробити мінімум log n! порівнянь то це і буде мінімальною кількістю операцій)
 * 
 * 
 * Приближення log(n!)
 * Використовуємо формулу Стірлінга для великих 𝑛:
 *    n!≈sqrt(2πn)*(n/e​)^n
 * 
 * log​(n!)≈ n*log n − n*log​ e + O(log n)
 * Тобто асимптотично це O(n log n).
 * 
 * 
 * 
 * 
 * Доведіть, що не існує порівняльного сортування, час виконання якого лінійний
 * щонайменше для половини з n! вхідних послідовностей довжини n. Як щодо
 * частки 1/n вхідних даних завдовжки n? Що можна сказати про частку 1/2^n?
 * 
 * Для прикладу половини вхідних даних (1/n)
 *   - мінімальна кількість листків для порівняння 1/2 n
 *   - мінімальна глибина дерева рішень дорівнює log n!/2 
 *   - мін. кількість порівнянь ≥ log​(n!/2)
 * 
 *    log​(n!/2) = log​(n!) - log​(2) = log​(n!) - 1
 *    Для цього випадку  мін. кількість порівнянь ≥ log​(n!) - 1, тож асимптотично O(n log n)
 * 
 *    ОДНАК для маленьких чисел (до 5 включно) буде ЛІНІЙНИЙ ЧАС
 *    Нехай n=4
 *    Тоді h (висота дерева, або мін. кількість порівнянь) = 4!/2 = 12
 *    h >= log 4!/2
 *    h >= log 12 - log 2
 *    h >= log 12 - 1
 *    h >= 3.58 - 1
 *    h >= 2.58
 *    Лінійний час порівняння (кількість вхідних даних) = 4, а мінімальна кількість порівнянь 2.58 (тобто 3 порівняння)
 *    Тож виходить що можливо навіть швидше ніж за лінійний час для n=4
 *
 *    Нехай n=6
 *    h >= log 6!/2
 *    h >= log 6! - log 2
 *    h >= log 720 - 1
 *    h >= 9.49 - 1
 *    h >= 8.49
 *    Лінійний час порівняння (кількість вхідних даних) = 6, а мінімальна кількість порівнянь 8.49 (тобто 9 порівнянь)
 *    На n=6 вийшли за лінійний час
 *
 *
 * Для прикладу вхідних даних 1/n:
 *   - мінімальна кількість листків для порівняння 1/n
 *   - мінімальна глибина дерева рішень  дорівнює log n!/n 
 *   - мін. кількість порівнянь ≥ log​(n!/n)
 * 
 *    log​(n!/n) = log​(n!) - log​(n)
 *    Для цього випадку  мін. кількість порівнянь≥ log​(n!) - log​(n), тож асимптотично O(n log n)
 *    
 *    ОДНАК для маленьких чисел (до 5 включно) буде ЛІНІЙНИЙ ЧАС (АБО МЕНШЕ)
 *    Нехай n=4
 *    Тоді h (висота дерева, або мін. кількість порівнянь) = 4!/4 = 6
 *    h >= log 4!/4
 *    h >= log 6
 *    h >= 2.58
 *    Лінійний час порівняння (кількість вхідних даних) = 4, а мінімальна кількість порівнянь 2.58, (тобто 3 порівняння)
 *    Тож виходить що можливо навіть швидше ніж за лінійний час для n=4
 * 
 *    Нехай n=6
 *    h >= log 6!/6
 *    h >= log 6! - log 6
 *    h >= log 720 - log 6
 *    h >= 9.49 - 2.58
 *    h >= 6.91
 *    Лінійний час порівняння (кількість вхідних даних) = 6, а мінімальна кількість порівнянь 6.91 (тобто 7 порівнянь)
 *    На n=6 вийшли за лінійний час 
 * 
 * 
 * Для прикладу вхідних даних 1/2^n:
 *   - мінімальна кількість листків для порівняння 1/2^n
 *   - мінімальна глибина дерева рішень  дорівнює log n!/2^n 
 *   - мін. кількість порівнянь ≥ log​(n!/2^n)
 * 
 *    log​(n!/2^n) = log​(n!) - log​(2^n)
 *    Для цього випадку мін. кількість порівнянь ≥ log​(n!) - log​(2^n), тож асимптотично O(n log n)
 *    
 *    ОДНАК для маленьких чисел (до 9 включно) буде ЛІНІЙНИЙ ЧАС (АБО МЕНШЕ)
 *    Нехай n=4
 *    Тоді h (висота дерева, або мін. кількість порівнянь) = 4!/2^4 = 1.5
 *    h >= log 4!/2^4
 *    h >= log 1.5
 *    h >= 0.58
 *    Лінійний час порівняння (кількість вхідних даних) = 4, а мінімальна кількість порівнянь 0.58 (тобто 1 порівняння)
 *    Тож виходить що можливо навіть швидше ніж за лінійний час для n=4
 * 
 *    Нехай n=9
 *    h >= log 9!/2^9
 *    h >= log 708.75
 *    h >= 9.46
 *    Лінійний час порівняння (кількість вхідних даних) = 9, а мінімальна кількість порівнянь 9.46 (тобто 10 порівнянь)
 *    На n=9 вийшли за лінійний час 
 * 
 * 
 * 
 * 
 * 
 * 
 */